acc1072.АвтоматизацияИнформированияДебиторов/src/InformationRegisters/Аид_ПравилаФормированияСобытий/Аид_ПравилаФормированияСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аид_ПравилаФормированияСобытий</name>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчитыватьЧасовойПояс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонСообщения</name>
    <type>
      <types>CatalogRef.Аид_ШаблоныСообщений</types>
    </type>
  </resources>
  <resources>
    <name>РазовоеУведомление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачалаСобытияУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.Аид_ВидыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусКонтрагента</name>
    <type>
      <types>CatalogRef.Аид_СтатусыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.Аид_ТипыСообщений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДеньНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоДнейЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючПравила</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДетализироватьПоОбъектамРасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

acc1072.АвтоматизацияИнформированияДебиторов/src/Enums/Аид_ТипыСообщений/Аид_ТипыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Аид_ТипыСообщений</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>SMS</name>
  </enumValues>
  <enumValues>
    <name>ГолосовоеСообщение</name>
  </enumValues>
</mdclass:Enum>

acc1072.АвтоматизацияИнформированияДебиторов/src/InformationRegisters/Аид_ПравилаФормированияСобытий/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	УстановитьПараметрыВыбораШаблонСообщений();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОбъектРасчетов.Видимость = Параметры.РазовоеУведомление; 
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Запись.КлючРегламентногоЗадания = ""; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораШаблонСообщений()
	
	Если Не Запись.ТипСообщения.Пустая() тогда
		ПараметрыВыбора = Новый Массив;
		Если Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.Email") тогда
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ВидСообщения", "Письмо"));
		ИначеЕсли Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.SMS") тогда
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ВидСообщения", "СообщениеSMS"));
		ИначеЕсли Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.ГолосовоеСообщение") тогда
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ВидСообщения", "ГолосовоеСообщение"));
	    КонецЕсли;
		Элементы.ШаблонСообщения.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыВыбораШаблонСообщений();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Проверяем на правильность заполнение времени, если установлен флаг УчитыватьЧасовойПояс
	Если ТекущийОбъект.УчитыватьЧасовойПояс Тогда
		РазницаЧасов = (ТекущийОбъект.ВремяОкончания - ТекущийОбъект.ВремяНачала)/3600;
		Если РазницаЧасов < 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При установленном флаге ""Учитывать часовой пояс"" 
																|разница между временем окончания и начала должна быть не меньше часа.",,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.КлючРегламентногоЗадания) Тогда	
		ТекущийОбъект.КлючРегламентногоЗадания = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Создаем сразу регл. задание по правилу.
	МассивКлючей = Новый Массив;
	МассивКлючей.Добавить(ТекущийОбъект.КлючРегламентногоЗадания);
	Аид_ОбщегоНазначенияПереопределяемый.ЗапускРегламентныхЗаданийАИД(МассивКлючей);
	
КонецПроцедуры
